from Flow import Flow
from Question import Question
import i18n

translator = i18n.Translator('data')

q1 = Question("intro1",
              "أهلا وسهلا فيك بمساحة نَفَس. \n هيّأنا هالمحل ليكون ملجأك وبيتك بهالفترة الصعبة, اللي تلجأله لما بدك تنقطع عن هالعالم لاكم دقيقة وتوخذ نفس. \n فأستعد لتغمر نفسك بتجربة جديدة من نوعها اللي من خلال فعاليّات بسيطة راح تساعدك تخفف التوتر وتدير التحديّات القادمة بشكل انجع.",
              "", [])
q2 = Question("intro2", "منتمنالك تجربة ممتعة وغنيّة اللي فيها تطلع الماكسيموم وتطوّر من نفسك!", "", [])
q3 = Question("intro3", " بدك تتعامل بشكل افضل مع التوتر والتحدايّات؟ ", "", ["اه، اكيد 💪"])
q4 = Question("intro4",
              "زي مبتعرف, اي تغيّير وتطوّر, بحاجة لجهد ومثابرة!  مستعد تعطيه هالفرصة ؟\n اوعد نفسك عن طريق صورة لأيدك مع اشارة النصر:  ✌🏻",
              "", ["بوعد نفسي"])
q5 = Question("intro5", "شكرا وهيك ممكن نبدا رحلتنا \n ٣ نقاط مهمات قبل لنبدأ:", "", [])
q6 = Question("intro6", "هالأدوات اللي راح تشوفها مبينة على عشرات السنين من الابحاث من معاهد مرموقة. ", "logos.jpeg", [])
q7 = Question("intro7", "مفش صح وغلط بهالتجربة!", "", [])
q8 = Question("intro8",
              "اعطي التغيير فرصة: خذلك نفس ل7 دقايق كل يوم ,لمدة 7 ايام \nراح تلاحظ بالايام القريبة تأثير الخطوات الصغيرة اللي كل يوم بتوخذها. \nجاهز تلتزم؟",
              "", ["قول جاهز🎤"])
q9 = Question("stress1", translator.translate('stress_question'), "", [translator.translate('stress_option1'),
                                                                       translator.translate('stress_option2'),
                                                                       translator.translate('stress_option3')])

q10 = Question("exc1", "f\"التمرين الاول\n\n[ ](https://www.youtube.com/shorts/9JhTMTksk9s)\"", "", [])
q11 = Question("exc1_1", "1. خذ نفس عميق وسريع من أنفك. قديش اكثر يملّي رئتيك \n  2. بدون متطلع الهوا, خذ كمان واحد صغير بعديه \n 3.وبشكل بطيئ (ابطئ من وقت النفسين اللي قبل) اطلع الهوا من خلال الثم", "", ["عملتها 💪"])
q12 = Question("exc1_2", "اعمل التمرين كمان مرتين", "", [])
q13 = Question("exc1_3", "خلصت؟", "", ["اه, يللا اللي بعدو"])
q14 = Question("exc1_4", "ثواني منجهز بالتمرين", "", [])
q15 = Question("exc1_5", "تمام, لكان عد معنا بالعكس من 30 ل 1 بعقلك, او افضل بصوت منخفض اذا بزبط بمعك ", "Countdown.mp4", [])
#q14 = Question("exc1_4", "f\"تمام, لكان عد معنا بالعكس من 30 ل 1 بعقلك, او افضل بصوت منخفض اذا بزبط بمعك\n\n[ ](https://www.youtube.com/watch?v=WernYF9GmAo)\"", "", [])

q16 = Question("exc1_5", "جاهز نعمل التمرين مع بعض؟ ", "", ["يللا 💪🏻"])



flow = Flow([q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11,q12, q13, q14, q15, q16])

# q1 ([next questions])
# q1, q2, q3, q4, q5, q6, q7, q8, q9, q10, q11,
